trigers = {
    #'хохол': "За хохла прошу пояснить!111!!!1",
    #"клитор": "Предоставьте информацию по клитору!",
    #"face": "<b>ЭЩКЕЕРЕЕЕЕЕ!!!!!</b>",
    #"фейс": "Вы <b>Face</b> написать не в состоянии?\nЯ хуею с людей тупых",
    #"фейса": "Вы <b>Face</b> написать не в состоянии?\nЯ хуею с людей тупых",
    #"курить": "ВЫ ЧО КУРИТЕ?\nКУРЕНИЕ УБИВАЕТ, АЛО",
    #"задали": "Д/З делают только дебилы",
    #"бот": "<i>БОТЫ КРУТА, БОТЫ КЛАСС</i>",
    #аниме": "Че пацаны <code>/а/ниме</code> ?",
    #"ебать": "Опять про еблю...",
    #"ебал": "Не надо матерных слов!",
    #"ебало": "Не ебало а лицо!!!\n",
    #"сука": "Матеряться только не красивые!",
    #"артем": "Еду в село, ловить питонов",
    #"иванов": "Питон - ахуенная тема!",
    #"иванова": "Питон - ахуенная тема!",
    #"илля": "Ща спрайты нарисуем",
    #"иляс": "Блять, ногу сломал",
    #"илюха": "Ща игру сделаем, наверное",
    #"илья": "Ща пойдем телок кадрить",
    #"карпусь": "<b>Карпусь</b>: Пер*непонятные_звуки*нi",
    #"карпуся": "<b>Карпусь</b>: Пер*непонятные_звуки*нi",
    #"андрюха": "НЕ, НУ АНДРЮХА ТОЧНО МУЖИК!",
    #"даня": "Даня котик и точка.",
    #"даниил": "1 2 3 4.... 1 2 3 4... 1 2... \nВ пизду матемантеку, я басист",
    #"дончик": "d0N 4ick HAS A LONG DICK",
    #"женя": "random.choice(Хмелевской, Хмельницкий)",
    #"женьок": "ШМАЛЬ - ТЕМА\nВсе, идем шмалить",
    #"богдан": "Богдан красивый, я вам говорю, я видела!",
    #"деморализатор": "Няша и скорее всего очень даже /sex",
    #"мухтар": "мне похуй",
    "карпик": "Да, я карпик, и что???",
    #"спокойной": "Время - поздний час\nДавайте чистить зубки\nИ пойдем спатки\nЦёмаю вас в носик, мои зайки :*",
    #"падре": "Ну ребят 🙄, я не пидор!!",
    #"дукалис":"Дукалис 👮‍♀️ хотя бы 👌 стрелять 🔫 умеет 💪 и протокол 📃 писать ✍️",
    #"тупая":"Это не я тупая, это разработчик дебил!!",
    #"чино":"БЭБИ",
    #"папай":"Я люблю тебя юнга 🚢",
    #"дэтком":"Харьков и Киев это любовь!",
    "42":"6 * 9 = 42"
}


schedule={
    0:"<b>Понедельник:</b>\n1. Охорона праці 63/ Політологія (Когда узнал) 63\n\n2. Інструм. засоби with. програм.(Дээ) 60\n\n3. ОПІ 43/ Конструювання ПЗ 43\n\n4. Консультация по КП 60",
    1:"<b>Вторник:</b>\n1. Конструювання ПЗ 37\n\n2. Директор 61\n\n3. Інструм. засоби with. програм.(Дээ) 60\n\n4. Консультация по КП (Дві пари Петра за день) 60",
    2:"<b>Среда:</b>\n1. Проєктний практикум 42\n\n2. Чисельні методи 37/ Мат. мет. дослід. ОПЕРАЦІЙ 37\n\n3. Теорія обслуговування мас 61",
    3:"<b>Четверг:</b>\n1. Мат. мет. дослід. ОПЕРАЦІЙ 60\n\n2. Теорія ймовір. і матем. статист. 60\n\n3. ОПІ 60 \n\n //(Тупо все пары в 60м. Бтв лол кстати)",
    4:"<b>Пятница:</b>\n1. ОПІать 60\n\n2. Інструм. засоби with. програм.(Дээ) 53/ Теорія ймовір. і матем. статист. 53\n\n3. Чисельні методи 37",
    5:"<b>ПИЙ ГОРIЛКУ, СЕГОДНЯ ВЬІХОДНОЙ</b>\n(суббота)",
    6:"<b>ПИЙ ГОРIЛКУ, СЕГ0ДНЯ ВЫХ0ДН0Й</b>\n(воскресенье)"
}

schedule_markup = {"inline_keyboard":
                      [[{"text": "Пн", "callback_data": "0"},
                        {"text": "Вт", "callback_data": "1"},
                        {"text": "Ср", "callback_data": "2"},
                        {"text": "Чт", "callback_data": "3"},
                        {"text": "Пт", "callback_data": "4"}]]
            , "resize_keyboard": True}

people_list = {
    'people1': """
1.Андрющенко Михайло Андрiйович
2.Бей Руслан Александрович
3.Вуciк Олег Юрiйович
4.Гордiенко Маргарита Романiвна
5.Дружинiна Марiя Олександрiвна
6.Зюбiн Iван Олексiйович
7.Iванов Артем Владиславович
*.Кондратьев Антон Андрiйович (А этот парень с нашей?)
8.Курашов Евгенiй Олександрович
9.Лещенко Андрюха Сергiйович
10.Максименков Олексiй Юрiйович
11.Мельтюхов Богдан Максимович
""",
    'people2': """
12.Орлов Микита Миколайович
13.Пелюшок Богдан Володимирович
14.Погоренко Наталiя Сергiiвна
15.Полторацька Анна Геннадiiвна
16.Рижков Кирило Павлович
17.Роздайвайфай Олег Юрiйович
18.Скрит Iрина Петрiвна
19.Хмелевський Евгенiй Володимирович
20.Хмельницький Даниiл Олександрович
21.Хоменко Iлля Сергiйович
22.Чайкiн Вiктор Владиславович
"""
}

people_list_markup = {"inline_keyboard":
                      [[{"text": "<<", "callback_data": "people1"},
                        {"text": ">>", "callback_data": "people2"}]]
            , "resize_keyboard": True}

text_answers = {
"/start": "Чат бот группы\nРПЗ- <b>315</b> ХКТК\n🐠🐠🐠",
"/danil": "<b>Даня котек</b>",
"/hello": "Привет, kotik ^_^",
"/github": "Голые исходники <code>только с 18</code>\nhttps://github.com/orlovw/karpikchan",
"/sex": "И немного <i>секса</i>",
"/ivan": "<code>T S Y A R</code>",
"8осемь": "8осемь раз по 8осемь сосен",
"/svetlana": "Света - солнышко чата",
"/detcom": "<b>ДЕТКОМ, ПОШЕЛ НАХУЙ, ХОХОЛ</b>",
"/ban": "<b>ЗОБАНьЮ!!!!</b>",
"/andre": "У вас ошибка в слове /andruxa",
"/vitya": "Чайник?",
"/ksenia": "Ксения это вам не Оксана\n<b>Понял, да?</b>",
"/face": "<b>ЭЩКЕЕЕЕРЕЕЕЕ!!11!!</b>",
"/marvel": "Самые норм сиги имхо, все остальное так себе\nВо славу Межера конечно",
"/bareyko": "Батарейко вообще-то\n"
            "<b>Саша котик</b>",
"/lilly": "<i>КРЯ КРЯ КРЯ</i>",
"/python": "Язык написаный дебилом для дебилов",
"/madway": "Любитель посмотреть аниме",
"/orlow": """<b>orlow</b> 🍀
Там токен

<b>orlow</b> 🍀
!!!

<b>Evgen Fil</b> // via @spin_everyday_bot
Кек

<b>Nick Rirush</b>
Ахахвхпхвх

<b>orlow</b> 🍀
[ 😭 Sticker ]

<b>Evgen Fil</b> // via @spin_everyday_bot
Ревокай

<b>Andrey</b>
Классческий Орлов
""",
"/oleks":"Олекс прав ты нет",
"/belka":"Настя хорошуля",
"/virgin":"Бойченко, поебись уже",
"/kolos":"Колос лох, я снупдог",
"/cortes":"Кортес гей",
"/mraz":"Светлана Николаевна Мразь",
"/siriga":"ЖОЖБЬ",
"/katwon":"Лучшая вечеринка эвер!",
"/gitler":"клаудрэп говно",
"/volk":"Яйца надо мыть. Если рядом есть река - мой яйца в реке",
"/fulgrim":"давай только без гайковорота тут",
"/pledov":"давай батл",
"/alice":"",
"/ilyuha":"Соболь разьебёт",
"/perkele":"быдло борщаговское, гопник трамвайный",
"/figus":"все гедонисты — пидарасы",
"/motuzyan":"Мотузян обожает шаурму на Бессарабке",
"/dawn":"НА ЗАРЕЕЕЕЕЕЕЕ\n\
ГОЛОСА ЗОВУУУУТ МЕНЯЯЯЯ",
"/legacy":"это когда тебя в жопу ебут"
}

tigran = ['У армянского радио спрашивают:\n\
- Чем Тигран отличается от пидораса?\n\
- У пидораса есть хуй.',
'У армянского радио спрашивают:\n\
- Чем Тигран отличается от мешка с говном?\n\
- Отсутствием мешка.',
'Попал Тигран на зону. Зэки у него спрашивают: \n\
- Вилку в глаз или в жопу раз?\n\
- А можно в жопу два раза?',
'У армянского радио спрашивают:\n\
- Что надо бросить тонущему Тиграну?\n\
- Палку.',
'Приходят как то тупая пизда, анальный клоун и даун в гей-клуб, а бармен им и говорит:\n\
- Тигран, у тебя абонемент истек.',
'У армянского радио спрашивают:\n\
- Может ли мужчина забеременеть? \n\
Армянское радио отвечает (указывая на Тиграна):\n\
- Мы работаем над этим, но он пока только пукает и просит добавки.',
'У армянского радио спрашивают :\n\
- Почему Тигран никогда не открывает форточку?\n\
- Он думает, что воняет снаружи.',
'У армянского радио спрашивают:\n\
- Чем новый чат отличается от старого\n\
- В старом нет клиторов',
'У армянского радио спрашивают:\n\
- Что надо бросить тонущему Тиграну?\n\
- Марину (потому что с латин. Марина - морская).',
'У армянского радио спрашивают:\n\
- Чем новый чат отличается от старого\n\
- В новом лижут клитор, а в старом сосут хуй',
'тигран лох',
'У армянского радио спрашивают :\n\
- Почему в Москве много пидоров, а в Питере только Тигран?\n\
- Москва первая выбирала.',
'Просыпается Тигран ночью и спрашивает:\n\
- Мариночка, ты спишь?\n\
- Да.\n\
- Ага, а тогда почему твой хуй у меня в жопе?\n\
- Ой, извини, сейчас выну.\n\
- Я тебе выну! Спи давай.',
'У армянского радио спрашивают:\n'
'- Почему Тиграна ласково называют зайкой?'
'- Потому что зайцы едят свое говно.',
"""
У армянского радио спрашивают :
- Что говорит Тигран, когда видит на улице собачье дерьмо?
- "Здравствуйте, коллега"

""",
"""
У армянского радио спрашивают :
- Почему Тиграна не берут в ВДВ?
- С самолётов запрещено сбрасывать дерьмо.

""",
"""
Сунул как то Вадим спящему Тиграну хуй в жопу, а тот спросонья как заорёт:
- АААА!!! Вады!
- Не кричи, дорогой, это я, Вадим! 
- Да нэт! Туда-суда вады!
""",
"""
Сунул как то Вадим спящему Тиграну хуй в жопу, а тот спросонья как заорёт:
- АААА!!! Вады!
- Не кричи, дорогой, это я, Вадим! 
- Да нэт! Туда-суда вады!
"""]

latitude = 49.9992089
longitude = 36.2429473

WORD_DAY = -1
