trigers = {
    #'хохол': "За хохла прошу пояснить!111!!!1",
    #"клитор": "Предоставьте информацию по клитору!",
    #"face": "<b>ЭЩКЕЕРЕЕЕЕЕ!!!!!</b>",
    #"фейс": "Вы <b>Face</b> написать не в состоянии?\nЯ хуею с людей тупых",
    #"фейса": "Вы <b>Face</b> написать не в состоянии?\nЯ хуею с людей тупых",
    #"курить": "ВЫ ЧО КУРИТЕ?\nКУРЕНИЕ УБИВАЕТ, АЛО",
    #"задали": "Д/З делают только дебилы",
    #"бот": "<i>БОТЫ КРУТА, БОТЫ КЛАСС</i>",
    #аниме": "Че пацаны <code>/а/ниме</code> ?",
    #"ебать": "Опять про еблю...",
    #"ебал": "Не надо матерных слов!",
    #"ебало": "Не ебало а лицо!!!\n",
    #"сука": "Матеряться только не красивые!",
    #"артем": "Еду в село, ловить питонов",
    #"иванов": "Питон - ахуенная тема!",
    #"иванова": "Питон - ахуенная тема!",
    #"илля": "Ща спрайты нарисуем",
    #"иляс": "Блять, ногу сломал",
    #"илюха": "Ща игру сделаем, наверное",
    #"илья": "Ща пойдем телок кадрить",
    #"карпусь": "<b>Карпусь</b>: Пер*непонятные_звуки*нi",
    #"карпуся": "<b>Карпусь</b>: Пер*непонятные_звуки*нi",
    #"андрюха": "НЕ, НУ АНДРЮХА ТОЧНО МУЖИК!",
    #"даня": "Даня котик и точка.",
    #"даниил": "1 2 3 4.... 1 2 3 4... 1 2... \nВ пизду матемантеку, я басист",
    #"дончик": "d0N 4ick HAS A LONG DICK",
    #"женя": "random.choice(Хмелевской, Хмельницкий)",
    #"женьок": "ШМАЛЬ - ТЕМА\nВсе, идем шмалить",
    #"богдан": "Богдан красивый, я вам говорю, я видела!",
    #"деморализатор": "Няша и скорее всего очень даже /sex",
    #"мухтар": "мне похуй",
    "карпик": "Да, я карпик, и что???",
    #"спокойной": "Время - поздний час\nДавайте чистить зубки\nИ пойдем спатки\nЦёмаю вас в носик, мои зайки :*",
    #"падре": "Ну ребят 🙄, я не пидор!!",
    #"дукалис":"Дукалис 👮‍♀️ хотя бы 👌 стрелять 🔫 умеет 💪 и протокол 📃 писать ✍️",
    #"тупая":"Это не я тупая, это разработчик дебил!!",
    #"чино":"БЭБИ",
    #"папай":"Я люблю тебя юнга 🚢",
    #"дэтком":"Харьков и Киев это любовь!",
    "42":"6 * 9 = 42"
}


schedule={
    0:"<b>Понедельник:</b>\n1. Базы данных 60\n\n2. Фезра (не Лапина)\n\n3. ООООП 33\n\n4. Консультация по КП 33",
    1:"<b>Вторник:</b>\n1. Философ и Я 25 \n\n2. Компьютерные мережи (сети) 60\n\n3. Английский 56/36\n\n4. Консультация по КП 33",
    2:"<b>Среда:</b>\n1. ----------\n\n2. Базы данных 42\n\n3. Компьютерные мережи (сети) 33\n\n4. Социлохия 46",
    3:"<b>Четверг:</b>\n1. Теория вероятности 60\n\n2. Фезра (с Мирошник да да)\n\n3. WEB-дизайн 42/ОООП 42\n\n4. Англиский 36|56 / -----------",
    4:"<b>Пятница:</b>\n1. Базы данных 33\n\n2. WEB-дизайн 42\n\n3. Охрана труда 13\n\n4. -------------- / Теория вероятности 60",
    5:"<b>ПИЙ ГОРIЛКУ, СЕГОДНЯ В    ЫХОДНОЙ</b>\n(суббота)",
    6:"<b>ПИЙ ГОРIЛКУ, СЕГОДНЯ ВЫХОДНОЙ</b>\n(воскресенье)"
}

schedule_markup = {"inline_keyboard":
                      [[{"text": "Пн", "callback_data": "0"},
                        {"text": "Вт", "callback_data": "1"},
                        {"text": "Ср", "callback_data": "2"},
                        {"text": "Чт", "callback_data": "3"},
                        {"text": "Пт", "callback_data": "4"}]]
            , "resize_keyboard": True}

people_list = {
    'people1': """
1.Андрющенко Михайло Андрiйович
2.Бей Руслан Александрович
3.Вуciк Олег Юрiйович
4.Гордiенко Маргарита Романiвна
5.Дружинiна Марiя Олександрiвна
6.Зюбiн Iван Олексiйович
7.Iванов Артем Владиславович
8.Кондратьев Антон Андрiйович
9.Курашов Евгенiй Олександрович
10.Лещенко Андрюха Сергiйович
11.Максименков Олексiй Юрiйович
12.Мельтюхов Богдан Максимович
""",
    'people2': """
13.Орлов Микита Миколайович
14.Пелюшок Богдан Володимирович
15.Погоренко Наталiя Сергiiвна
16.Полторацька Анна Геннадiiвна
17.Рижков Кирило Павлович
18.Роздайвайфай Олег Юрiйович
19.Скрит Iрина Петрiвна
20.Хмелевський Евгенiй Володимирович
21.Хмельницький Даниiл Олександрович
22.Хоменко Iлля Сергiйович
23.Чайкiн Вiктор Владиславович
"""
}

people_list_markup = {"inline_keyboard":
                      [[{"text": "<<", "callback_data": "people1"},
                        {"text": ">>", "callback_data": "people2"}]]
            , "resize_keyboard": True}

text_answers = {
"/start": "Чат бот группы\nРПЗ- <b>315</b> ХКТК\n🐠🐠🐠",
"/danil": "<b>Даня котек</b>",
"/hello": "Привет, kotik ^_^",
"/github": "Голые исходники <code>только с 18</code>\nhttps://github.com/orlovw/karpikchan",
"/sex": "И немного <i>секса</i>",
"/ivan": "<code>T S Y A R</code>",
"8осемь": "8осемь раз по 8осемь сосен",
"/svetlana": "Света - солнышко чата",
"/detcom": "<b>ДЕТКОМ, ПОШЕЛ НАХУЙ, ХОХОЛ</b>",
"/ban": "<b>ЗОБАНьЮ!!!!</b>",
"/andre": "У вас ошибка в слове /andruxa",
"/vitya": "Чайник?",
"/ksenia": "Ксения это вам не Оксана\n<b>Понял, да?</b>",
"/face": "<b>ЭЩКЕЕЕЕРЕЕЕЕ!!11!!</b>",
"/marvel": "Самые норм сиги имхо, все остальное так себе\nВо славу Межера конечно",
"/bareyko": "Батарейко вообще-то\n"
            "<b>Саша котик</b>",
"/lilly": "<i>КРЯ КРЯ КРЯ</i>",
"/python": "Язык написаный дебилом для дебилов",
"/madway": "Любитель посмотреть аниме",
"/orlow": """<b>orlow</b> 🍀
Там токен

<b>orlow</b> 🍀
!!!

<b>Evgen Fil</b> // via @spin_everyday_bot
Кек

<b>Nick Rirush</b>
Ахахвхпхвх

<b>orlow</b> 🍀
[ 😭 Sticker ]

<b>Evgen Fil</b> // via @spin_everyday_bot
Ревокай

<b>Andrey</b>
Классческий Орлов
""",
"/oleks":"Олекс прав ты нет",
"/belka":"Настя хорошуля",
"/virgin":"Бойченко, поебись уже",
"/kolos":"Колос лох, я снупдог",
"/cortes":"Кортес гей",
"/mraz":"Светлана Николаевна Мразь",
"/siriga":"ЖОЖБЬ",
"/katwon":"Лучшая вечеринка эвер!",
"/gitler":"клаудрэп говно",
"/volk":"Яйца надо мыть. Если рядом есть река - мой яйца в реке",
"/fulgrim":"давай только без гайковорота тут",
"/pledov":"давай батл",
"/alice":"",
"/ilyuha":"Соболь разьебёт",
"/perkele":"быдло борщаговское, гопник трамвайный",
"/figus":"все гедонисты — пидарасы",
"/motuzyan":"Мотузян обожает шаурму на Бессарабке",
"/dawn":"НА ЗАРЕЕЕЕЕЕЕЕ\n\
ГОЛОСА ЗОВУУУУТ МЕНЯЯЯЯ"
}

tigran = ['У армянского радио спрашивают:\n\
- Чем Тигран отличается от пидораса?\n\
- У пидораса есть хуй.',
'У армянского радио спрашивают:\n\
- Чем Тигран отличается от мешка с говном?\n\
- Отсутствием мешка.',
'Попал Тигран на зону. Зэки у него спрашивают: \n\
- Вилку в глаз или в жопу раз?\n\
- А можно в жопу два раза?',
'У армянского радио спрашивают:\n\
- Что надо бросить тонущему Тиграну?\n\
- Палку.',
'Приходят как то тупая пизда, анальный клоун и даун в гей-клуб, а бармен им и говорит:\n\
- Тигран, у тебя абонемент истек.',
'У армянского радио спрашивают:\n\
- Может ли мужчина забеременеть? \n\
Армянское радио отвечает (указывая на Тиграна):\n\
- Мы работаем над этим, но он пока только пукает и просит добавки.',
'У армянского радио спрашивают :\n\
- Почему Тигран никогда не открывает форточку?\n\
- Он думает, что воняет снаружи.',
'У армянского радио спрашивают:\n\
- Чем новый чат отличается от старого\n\
- В старом нет клиторов',
'У армянского радио спрашивают:\n\
- Что надо бросить тонущему Тиграну?\n\
- Марину (потому что с латин. Марина - морская).',
'У армянского радио спрашивают:\n\
- Чем новый чат отличается от старого\n\
- В новом лижут клитор, а в старом сосут хуй',
'тигран лох',
'У армянского радио спрашивают :\n\
- Почему в Москве много пидоров, а в Питере только Тигран?\n\
- Москва первая выбирала.',
'Просыпается Тигран ночью и спрашивает:\n\
- Мариночка, ты спишь?\n\
- Да.\n\
- Ага, а тогда почему твой хуй у меня в жопе?\n\
- Ой, извини, сейчас выну.\n\
- Я тебе выну! Спи давай.']

latitude = 49.9992089
longitude = 36.2429473

WORD_DAY = -1