schedule={
    0:"<b>Понедельник:</b>\n1. Английский 56/36 \n\n2. Укр.мова 56\n\n3. АСД 42\n\n4. Соц.мережi 43",
    1:"<b>Вторник:</b>\n1. Дискретка 33 \n\n2. Опер.системы 33\n\n3. КГ (Карпусь) 43",
    2:"<b>Среда:</b>\n1. ООП 65\n(перша пара Лысяк, everything is fucked)\n\n2. АСД 42\n\n3. Фезра С/З",
    3:"<b>Четверг:</b>\n1. Опер.системы 33 \n\n2. ООП 42\n\n3. Фезра С/З",
    4:"<b>Пятница:</b>\n1. АСД 42/Опер.системы 33\n\n2. КГ (Карпусь) 43\n\n3. Дискретка 33",
    5:"<b>ПИЙ ГОРIЛКУ, СЕГОДНЯ ВЫХОДНОЙ</b>\n(суббота)",
    6:"<b>ПИЙ ГОРIЛКУ, СЕГОДНЯ ВЫХОДНОЙ</b>\n(воскресенье)"
}

schedule_markup = {"inline_keyboard":
                      [[{"text": "Пн", "callback_data": "0"},
                        {"text": "Вт", "callback_data": "1"},
                        {"text": "Ср", "callback_data": "2"},
                        {"text": "Чт", "callback_data": "3"},
                        {"text": "Пт", "callback_data": "4"}]]
            , "resize_keyboard": True}

people_list = {
    'people1': """
1.Андрющенко Михайло Андрiйович
2.Бей Руслан Александрович
3.Вуciк Олег Юрiйович
4.Гордiенко Маргарита Романiвна
5.Дружинiна Марiя Олександрiвна
6.Зюбiн Iван Олексiйович
7.Iванов Артем Владиславович
8.Кондратьев Антон Андрiйович
9.Курашов Евгенiй Олександрович
10.Лещенко Андрюха Сергiйович
11.Максименков Олексiй Юрiйович
12.Мельтюхов Богдан Максимович
""",
    'people2': """
13.Орлов Микита Миколайович
14.Пелюшок Богдан Володимирович
15.Погоренко Наталiя Сергiiвна
16.Полторацька Анна Геннадiiвна
17.Рижков Кирило Павлович
18.Роздайвайфай Олег Юрiйович
19.Скрит Iрина Петрiвна
20.Хмелевський Евгенiй Володимирович
21.Хмельницький Даниiл Олександрович
22.Хоменко Iлля Сергiйович
23.Чайкiн Вiктор Владиславович
"""
}

people_list_markup = {"inline_keyboard":
                      [[{"text": "<<", "callback_data": "people1"},
                        {"text": ">>", "callback_data": "people2"}]]
            , "resize_keyboard": True}

text_answers = {
    "/start": "Чат бот группы\nРПЗ- <b>315</b> ХКТК\n🐠🐠🐠",
    "/danil": "<b>Даня котек</b>",
    "/hello": "Привет, kotik ^_^",
    "/github": "Голые исходники <code>только с 18</code>\nhttps://github.com/orlovw/karpikchan",
    "/sex": "И немного <i>секса</i>",
    "/ivan": "<code>T S Y A R</code>",
    "8осемь":"8осемь раз по 8осемь сосен",
    "/vitya":"https://www.google.com.ua/search?q=%D1%87%D0%B0%D0%B9%D0%BD%D0%B8%D0%BA",
    "/orlow": "t.me/orlow"
}