trigers = {
    'хохол': "За хохла прошу пояснить!111!!!1",
    #"клитор": "Предоставьте информацию по клитору!",
    "face": "<b>ЭЩКЕЕРЕЕЕЕЕ!!!!!</b>",
    "фейс": "Вы <b>Face</b> написать не в состоянии?\nЯ хуею с людей тупых",
    "фейса": "Вы <b>Face</b> написать не в состоянии?\nЯ хуею с людей тупых",
    "курить": "ВЫ ЧО КУРИТЕ?\nКУРЕНИЕ УБИВАЕТ, АЛО",
    "задали": "Д/З делают только дебилы",
    "бот": "<i>БОТЫ КРУТА, БОТЫ КЛАСС</i>",
    "аниме": "Че пацаны <code>/а/ниме</code> ?",
    #"ебать": "Опять про еблю...",
    #"ебал": "Не надо матерных слов!",
    "ебало": "Не ебало а лицо!!!\n",
    #"сука": "Матеряться только не красивые!",
    "артем": "Еду в село, ловить питонов",
    "иванов": "Питон - ахуенная тема!",
    "иванова": "Питон - ахуенная тема!",
    "илля": "Ща спрайты нарисуем",
    "иляс": "Блять, ногу сломал",
    "илюха": "Ща игру сделаем, наверное",
    "илья": "Ща пойдем телок кадрить",
    "карпусь": "<b>Карпусь</b>: Пер*непонятные_звуки*нi",
    "карпуся": "<b>Карпусь</b>: Пер*непонятные_звуки*нi",
    "андрюха": "НЕ, НУ АНДРЮХА ТОЧНО МУЖИК!",
    "даня": "Даня котик и точка.",
    "даниил": "1 2 3 4.... 1 2 3 4... 1 2... \nВ пизду матемантеку, я басист",
    "дончик": "d0N 4ick HAS A LONG DICK",
    "женя": "random.choice(Хмелевской, Хмельницкий)",
    "женьок": "ШМАЛЬ - ТЕМА\nВсе, идем шмалить",
    "богдан": "Богдан красивый, я вам говорю, я видела!",
    "деморолизатор": "Вшивый довен!!!1!",
    "мухтар": "Собака тупая, отвечаю",
    "карпик": "Да, я карпик, и что???",
    "спокойной": "Время - поздний час\nДавайте чистить зубки\nИ пойдем спатки\nЦёмаю вас в носик, мои зайки :*"

}


schedule={
    0:"<b>Понедельник:</b>\n1. Английский 56/36 \n\n2. Укр.мова 56\n\n3. АСД 42\n\n4. Соц.мережi 43",
    1:"<b>Вторник:</b>\n1. Дискретка 33 \n\n2. Опер.системы 33\n\n3. КГ (Карпусь) 43",
    2:"<b>Среда:</b>\n1. ООП 65\n(перша пара Лысяк, everything is fucked)\n\n2. АСД 42\n\n3. Фезра С/З",
    3:"<b>Четверг:</b>\n1. Опер.системы 33 \n\n2. ООП 42\n\n3. Фезра С/З",
    4:"<b>Пятница:</b>\n1. АСД 42/Опер.системы 33\n\n2. КГ (Карпусь) 43\n\n3. Дискретка 33",
    5:"<b>ПИЙ ГОРIЛКУ, СЕГОДНЯ ВЫХОДНОЙ</b>\n(суббота)",
    6:"<b>ПИЙ ГОРIЛКУ, СЕГОДНЯ ВЫХОДНОЙ</b>\n(воскресенье)"
}

schedule_markup = {"inline_keyboard":
                      [[{"text": "Пн", "callback_data": "0"},
                        {"text": "Вт", "callback_data": "1"},
                        {"text": "Ср", "callback_data": "2"},
                        {"text": "Чт", "callback_data": "3"},
                        {"text": "Пт", "callback_data": "4"}]]
            , "resize_keyboard": True}

people_list = {
    'people1': """
1.Андрющенко Михайло Андрiйович
2.Бей Руслан Александрович
3.Вуciк Олег Юрiйович
4.Гордiенко Маргарита Романiвна
5.Дружинiна Марiя Олександрiвна
6.Зюбiн Iван Олексiйович
7.Iванов Артем Владиславович
8.Кондратьев Антон Андрiйович
9.Курашов Евгенiй Олександрович
10.Лещенко Андрюха Сергiйович
11.Максименков Олексiй Юрiйович
12.Мельтюхов Богдан Максимович
""",
    'people2': """
13.Орлов Микита Миколайович
14.Пелюшок Богдан Володимирович
15.Погоренко Наталiя Сергiiвна
16.Полторацька Анна Геннадiiвна
17.Рижков Кирило Павлович
18.Роздайвайфай Олег Юрiйович
19.Скрит Iрина Петрiвна
20.Хмелевський Евгенiй Володимирович
21.Хмельницький Даниiл Олександрович
22.Хоменко Iлля Сергiйович
23.Чайкiн Вiктор Владиславович
"""
}

people_list_markup = {"inline_keyboard":
                      [[{"text": "<<", "callback_data": "people1"},
                        {"text": ">>", "callback_data": "people2"}]]
            , "resize_keyboard": True}

text_answers = {
"/start": "Чат бот группы\nРПЗ- <b>315</b> ХКТК\n🐠🐠🐠",
"/danil": "<b>Даня котек</b>",
"/hello": "Привет, kotik ^_^",
"/github": "Голые исходники <code>только с 18</code>\nhttps://github.com/orlovw/karpikchan",
"/sex": "И немного <i>секса</i>",
"/ivan": "<code>T S Y A R</code>",
"8осемь": "8осемь раз по 8осемь сосен",
"/svetlana": "Света - солнышко чата",
"/detcom": "<b>ДЕТКОМ, ПОШЕЛ НАХУЙ, ХОХОЛ</b>",
"/ban": "<b>ЗОБАНьЮ!!!!</b>",
"/andre": "У вас ошибка в слове /andruxa",
"/vitya": "Чайник?",
"/ksenia": "Ксения это вам не Оксана\n<b>Понял, да?</b>",
"/face": "<b>ЭЩКЕЕЕЕРЕЕЕЕ!!11!!</b>",
"/marvel": "Самые норм сиги имхо, все остальное так себе\nВо славу Межера конечно",
"/bareyko": "Батарейко вообще-то\n"
            "<b>Саша котик</b>",
"/lilly": "<i>КРЯ КРЯ КРЯ</i>",
"/python": "Язык написаный дебилом для дебилов",
"/madway": "Любитель посмотреть аниме",
"/orlow": """<b>orlow</b> 🍀
Там токен

<b>orlow</b> 🍀
!!!

<b>Evgen Fil</b> // via @spin_everyday_bot
Кек

<b>Nick Rirush</b>
Ахахвхпхвх

<b>orlow</b> 🍀
[ 😭 Sticker ]

<b>Evgen Fil</b> // via @spin_everyday_bot
Ревокай

<b>Andrey</b>
Классческий Орлов
"""}

latitude = 49.9992089
longitude = 36.2429473

WORD_DAY = -1